{"url": "https://www.imdb.com/review/rw7852959/", "title": "Death on the Nile", "review_header": "Love triangle on the Nile. Well, sort of.", "review_content": "Aside from the sad state that Armie Hammer and Gal Gadot act like they were in a school play instead of a serious motion picture, Kenneth Branagh's Death on the Nile is still a glossy entertainer. However, his decision to shift the focus on \"love and its hardship drama\" rather as an actual murder mystery, made the film more lackluster than exuberant.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "12 / 24"}
{"url": "https://www.imdb.com/review/rw7867817/", "title": "Death on the Nile", "review_header": "Good but very easy to predict", "review_content": "Even though the movie was very good, in the first 10 minutes I already knew who would die and who would kill... Really hope we get a third and fourth movie.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "7 / 10"}
{"url": "https://www.imdb.com/review/rw7849477/", "title": "Death on the Nile", "review_header": "Another classy adaption showing what a genius Christie was", "review_content": "I went on a little Agatha Christie book binge a year or so back but I purposely left 'Death on the Nile' alone so the story would be fresh for me when this movie eventually came out. I had gone into 'Murder on the Orient Express' the same way, without knowing the story and enjoyed it that little bit more because of it. The result was the same again, I had a great time with 'Death on the Nile'.The cast isn't quite as strong this time around I have to start by saying. Mind you the cast for that film was incredible and was always going to be hard to live up to. The lack of star power didn't have to hurt the film necessarily, but I did find quite a few of the performances quite flat this time around.I found the story in this one absolutely top-notch. A lot of time is put into the set up (slightly over half the film) and yet it never feels pointless or sluggish. For a film with very little in the way of action the pacing is terrific. As for the the actual mystery itself, I found it very clever. I was stumped and the reveal was a delight. Christie really was a genius.Kenneth Branagh is excellent in the role of Poirot once again. He's charming, funny and captivating to watch every time he's on screen. The only issue, and I understand this is not his fault, but the character has a very heavy accent which can make it quite hard to pick up the dialogue a lot of the time - and this is not a film where you want to be missing lines of dialogue.Finally, it's a great looking film it has to be said. The setting is beautiful and everything is shot in very visually appealing fashion. I had a really good time with 'Death on the Nile' and would highly recommend it, particularly if you enjoyed 'Murder on the Orient Express'. 9/10.", "language": "English", "rating": "9", "max_rating": "10", "helpful_review": "58 / 136"}
{"url": "https://www.imdb.com/review/rw7861204/", "title": "Death on the Nile", "review_header": "A little too easy", "review_content": "It was a little too easy to solve. I knew who the murderer(s) were just a little sooner than I'd hoped -maybe 20-30 minutes in I knew for sure. I unfortunately was bored after that and fell asleep. Only waking up for gun shots. I also don't think that Gal Gadot could act very well.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "7 / 10"}
{"url": "https://www.imdb.com/review/rw7861765/", "title": "Death on the Nile", "review_header": "Worse than Murder on the Orient Express - inaccurate, pretentious and desperate", "review_content": "The opening scene tells all you need to know. Twerking dance in 1936!!! That is a sure sign of desperation which is obvious in the rest of the movie. No authenticity, horrible acting, atrocious directing. Full of horrible CGI scenery that a 10 year old can tell its fake.Save yourself money and time and watch the 1978 version with Peter Ustinov as Poirot. Or better yet see TV series played by David Suchet. Both are 100 times better and sensible that this absolute garbage of movie.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "296 / 371"}
{"url": "https://www.imdb.com/review/rw8032720/", "title": "Death on the Nile", "review_header": "No, no, no, no, no ... all is not as it seems", "review_content": "I suppose you could say this is a fake film for fake times..It looked surreal because it was surreal..Yes, it looked spectacular and lavish, but it was just not real..Just about everything was created on a computer, no trip to Egypt required..The day will come when CGI is so good there will be no need for actors and actresses. It will all be created by software..Rather than follow an established story with the same characters the need to force feed the viewer with PC wokery had to be catered for first..So we had, characters left out, characters introduced, names changed, genders changed, nationalities changed, ethnicity changed, same sex relationship introduced ... what a mess..Ironically, the outing of same sex relationship by Poirot in the reveal was callous and cruel. It played no part in the plot at all, in fact the portrayal of Poirot was way off the mark..Sophie Okonedo was the best thing in it, she was superb and disappointing that she was wasted in this poor adaptation..Both the TV drama (2004) and the 1978 film were better than this attempt, both being shot on location with actual REAL locations..Watch the 1978 film, it is much better and follows the original plot far more closely.", "language": "English", "rating": "2", "max_rating": "10", "helpful_review": "116 / 154"}
{"url": "https://www.imdb.com/review/rw7881557/", "title": "Death on the Nile", "review_header": "Please (from Argentina)", "review_content": "I beg Mr. Branagh to direct and/or produce films based on Agatha Christie's novels but NOT TO PERFORM as Hercule Poirot, anymore. Please...Not even his moustache is credible.After having watched Peter Ustinov's and David Suchet's WONDERFUL Poirots...there is no way I can like this current Hercule.Neither in this movie nor in the previous one.Besides,as a Christie's fan, I watched the 1978 version of her novel and that was a beautiful piece of art. Actually located in Egypt and full of great famous actors (who were absolutely absent at this time).This is my humble advice to Kenneth ...knowing he won't read it,of course.I hope the other people here (at IMDB) will join my wish.Regards from Argentina.♥", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "4 / 5"}
{"url": "https://www.imdb.com/review/rw7883001/", "title": "Death on the Nile", "review_header": "Really rather good !", "review_content": "So I love the 1978 version . Fantastic costumes and hilarious performances from Dame Maggie Smith, Dame Angela Lansbury and Bette Davis . And Sir Peter Ustinov the definitive Poirot .But hold on .. Sir Kenneth Branagh has cleverly added some neat twists to the plot . A great opening scene where we discover the reason for his extravagant moustache . There are a few subtractions and additions to the multiple characters too . Some outstanding performances especially Annette Bening and Sophie Okanado . Once you're used to French and Saunders and realise this isn't one of their parodies they work well too ! Oh and a nice twist on their pairing .It looks stunning and wonderfully cinematic . And a hopeful and rather sweet ending too.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "6 / 7"}
{"url": "https://www.imdb.com/review/rw8019132/", "title": "Death on the Nile", "review_header": "Takes a while to get going", "review_content": "Probably the first hour of this was dull and meandering, but the last half was pretty decent. Unfortunately there's some pretty bad CG and a little bit too much extraneous stuff to really make this work. An okay attempt, but not up to the old Poirot TV show standards.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "8 / 15"}
{"url": "https://www.imdb.com/review/rw7864025/", "title": "Death on the Nile", "review_header": "One of the following statements is false", "review_content": "1) This is a pretty solid adaptation, well-shot and acted, although most changes from the source material are for the worse, and I am no purist.2) We get an origin story for Poirot's moustache during World War One (!).3) I still prefer Ustinov's and Suchet's versions of Poirot over Branagh's.4) The modern tendency to \"humanize\" archetypal characters (see also James Bond), with a tragic backstory, a lost love and so on, ends up weakening them compared to their simpler, more effective versions. Poirot does not need to weep, lament his immortal beloved or point a gun at the suspect with trembling hands. By giving the Belgian detective a sassy love interest who makes him stutter you are not giving him more depth, you are making him more generic.5) Gal Gadot is hot, Emma Mackey is hotter and the sadly underused Rose Leslie is fire.6) I love Agatha's books but man do her killers have some crappy plans relying on a string of good luck, coincidences and involuntary collaboration of bystanders.7) Water is not wet.6,5/10.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "19 / 42"}
{"url": "https://www.imdb.com/review/rw7877422/", "title": "Death on the Nile", "review_header": "Disappointing", "review_content": "The Poirot from the books, other movies, and the great TV series would not shave his mustaches and chase a night club singer..This is just surrendering to wokeness. Wokeness is faiding. Production crews like this one will be laughed at.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "9 / 13"}
{"url": "https://www.imdb.com/review/rw7902005/", "title": "Death on the Nile", "review_header": "Decent as a film, bad as an adaptation", "review_content": "If this weren't a Hercule Poirot adaptation, I would have quite enjoyed it. As an adaptation, it is a crime against life and memory..I don't actually mind how much they changed the story - what really bugs me is how much they assassinated Poirot's character. They turned a cheerful, laid-back person into someone who is brooding and miserable! And removing Poirot's moustache is a catastrophe!.Agatha Christie stories have always been family stories. This movie has non-sex scenes that are somehow raunchier than actual sex scenes..On the plus side - the scenery and cinematography is quite nice .", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "6 / 7"}
{"url": "https://www.imdb.com/review/rw7867445/", "title": "Death on the Nile", "review_header": "Subpar", "review_content": "By comparison, this is multiple levels below recent mainstream mysteries Knives Out and Murder on the Orient Express. The mystery has some intrigue but not much. The pacing is off and it takes a while (over an hour) before the mystery actually begins. I'm not a fan of the tone or the music. The actors are frequently over-the-top, sometimes reaching cartoonish territory.Overall, this movie is not put together very well. And I found it only mildly entertaining when I wasn't bored. (1 viewing, 2/14/2022)", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "273 / 372"}
{"url": "https://www.imdb.com/review/rw7857271/", "title": "Death on the Nile", "review_header": "Not as good as the 1978 original but still worth seeing.", "review_content": "Hercule Poirot (Kenneth Branaugh) is traveling on a large ship down the Nile River when a beautiful young heiress (Gal Gadot) is killed. The problem is everybody on board had a reason to kill her. It's up to Poirot to find the murderer while the bodies pile up..Beautifully filmed with stunning images (wide-screen viewing is essential) and a great cast who are all wonderful in their roles. The sets and costume design are just incredible. Trust me--they WILL be Oscar-nominated next year! The story is intricate and full of twists and turns. Still the 1978 version is just a little bit better. It had a sense of humor and playfulness about it. This one is dead serious all the way through. Still it's worth seeing.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "68 / 146"}
{"url": "https://www.imdb.com/review/rw7868647/", "title": "Death on the Nile", "review_header": "It's quite good.", "review_content": "I think this film deserves better ratings and reviews than he usually gets. I quite enjoyed it. It's better than Brannagh's first Poirot effort, in my opinion. It looks gorgeous, the direction, writing, acting, music, costumes and cinematography are all pretty good. I could gladly watch it again.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "9 / 20"}
{"url": "https://www.imdb.com/review/rw8101059/", "title": "Death on the Nile", "review_header": "The real murderer is the writer of this remake", "review_content": "Kenneth Branagh must not have liked the original story or characters much, given all the changes he made. This is a terrible movie on many levels.Poirot is a different character. He is now a former war hero with a lost love and a romantic side. Unforgivably, Branagh creates a major departure involving Poirot's signature moustache. There is an obligatory nod to Poirot's obsession with order and symmetry, but overall this is not the character in the Christie novels. Why didn't Kenneth Branagh just create a new detective named Branagh rather than rewriting Poirot? Agatha Christie herself found her most popular character insufferable, but she never changed him to make him more \"normal.\"Then there is the miscasting. Gal Gadot, who is always appealing but who has neither a British nor American accent, is not even remotely believable as British heiress Lynette Ridgeway. In addition, her backstory includes an instance in which she summers in Kennebunkbort, Maine. Perhaps visiting the Bush family? So she's a New Englander too!In the novel, Ridgeway's lawyer is a childhood playmate and cousin named Pennington. In this movie, he is from India and named Katdhadorian. He's supposed to be family!? An elderly woman and her caretaker on board the ship (a spinster with her nurse in Christie's original), are in a lesbian relationship.A white character in the original novel, a British writer of terrible romance novels, is transformed into a great black blues singer, Salome Otterborne, whose daughter, Rosalie, we are told, is the irresistible love interest of a British toff. It's a good thing the script tells us this, because there is no evidence of sexual attraction or infatuation on screen. Poirot delivers a paean to here, filled with white guilt, and she replies with scorn. Both of their speeches are straight out of the woke wars of the present and have nothing to do with an Agatha Christie murder mystery.Rosalie also talks about racism she one experienced at a whites-only swimming pool in the US. So it's not just Death on the Nile. It's Death on the Mississippi Burning.Does any of this sound like Agatha Christie? Or is Branagh just using her name to get moviegoers to watch a different film? None of these problems are helped by the excessive length, slow pacing and bad CGI . A new remake should be an improvement over previous remakes, but so much of the scenery in this film is digitally created, it feels like animation.Avoid this. Look for an earlier TV or film version or read the book.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "95 / 114"}
{"url": "https://www.imdb.com/review/rw7558788/", "title": "Red Notice", "review_header": "Ryan Reynolds Charm Has Expired.", "review_content": "When the trailers for this rolled around I initially thought this was yet another advert for Dubai which uses famous faces surrounded by expensive looking stuff us mortals will never see in real life.Then it dawned on me this was an actual movie.The three leads are stars in their own right however something about this gave the appearance of a committee meeting that concluded that Ryan, Gal and Dwayne co-starring would be box office gold.The problem was my initial reaction was \"no not another film with him...or her...or him!\". At the moment you can't seem to escape any of these actors at the Cinema and its becoming wearing.This feeling of fatigue is mainly driven by Ryans now irritating smart guy dialogue. In this movie its absolutely grating. Deadpool was one thing but its just incessant and needs to stop. He is basically playing the same person in all of these movies.The film itself if standard glossy rich people drama with a few twists and turns, some average action scenes and a cast which frankly bores. None of the characters are likeable.While it seems to be set for a sequel I am not sure the audience would welcome one based on this movie.It appears these actors and starting to believe their own hype, Dwayne thinks he would make a great James Bond. This movie may just bring them back to earth with a bump.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "13 / 19"}
{"url": "https://www.imdb.com/review/rw7539465/", "title": "Red Notice", "review_header": "Ryan Reynolds carried the whole movie", "review_content": "The Rock and Gal Gadot are here with their boring acting. But Ryan Reynolds comic timing is good and made the whole movie enjoyable.I even think Rock isn't fit for the roll. However the movie is entertainment packed. Generic story line with some fight scenes.", "language": "English", "rating": null, "max_rating": "", "helpful_review": "78 / 126"}
{"url": "https://www.imdb.com/review/rw7541428/", "title": "Red Notice", "review_header": "RED NOTICE should be billed as DIRE WARNING", "review_content": "I have one burning question, who in hell, keeps giving Gal Gadot movie roles, she should be given acting lessons. The same thing should be held true for Wayne (Pebbles) Johnson, but he invested money in the movie so he actually paid himself for his movie role. The movie is billed as a comedy, I'm still waiting to see what's funny about this movie, Ryan Reynolds is the same in every movie he's in sorta like a mini Jim Carey. The lead female role for me was screaming for Angelina Jolie, other than that, this is just another turkey that can't fly. I guess Hollywood is thinking about expanding the franchise, building movies around, DUMB, DUMMER and Just DUMB!", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "23 / 35"}
{"url": "https://www.imdb.com/review/rw8131737/", "title": "Red Notice", "review_header": "Unoriginal but undoubtedly entertaining", "review_content": "We've all seen this film before, so if you're looking for originality you'll need to search elsewhere. You don't need to look very closely to recognise aspects of films like 'Raiders of the Lost Arc', 'National Treasure', 'True Lies', 'Hobbs & Shaw', etc. There's even some jokes in here that directly point out how generic the plot is, including a funny line where Booth, while looking for one of the eggs, says \"Look for a box that says MacGuffin\". It's that kind of movie. It's that kind of script. Although there are certainly way too many plot contrivances, I knew going in that this wasn't going to be the most intellectually stimulating film. This is one of those films that you're not supposed to think too hard about. 'Red Notice' is an action comedy. It wants you to just relax and enjoy the silliness, so that's exactly what I did.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "3 / 3"}
{"url": "https://www.imdb.com/review/rw7544568/", "title": "Red Notice", "review_header": "RED CARD FOR ALL INVOLVED", "review_content": "With a cast like this, how was it possible to produce such crap. All I can think is.... There are now too many streaming channels, so to fill the schedules, they churn out whatever rubbish they can. Film making is now at an all time low in my opinion.1/10.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "17 / 25"}
{"url": "https://www.imdb.com/review/rw7560570/", "title": "Red Notice", "review_header": "Worse than expected", "review_content": "I knew it wasn't going to be amazing, I expected a silly easy movie. However this was incredibly stupid. I love Ryan Reynolds but he is playing the same character as always - cracking way too many jokes that aren't funny. Only a few jokes made me giggle.It felt like a children's Movie to be honest.There was also a lot of CGI/green screen that looked way too fake.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "10 / 14"}
{"url": "https://www.imdb.com/review/rw7547359/", "title": "Red Notice", "review_header": "Oh hell, noooo", "review_content": "It's frightening to see how lowbrow Hollywood has become when it comes to producing comedies - and how easily an audience seems to approve of this crap. Although the rating here has dropped from 6.9 to 6.5 within a short time, this rating still screams to heaven. \"Red Notice\" has holes in its logic that are unfathomable. Quick cuts don't change the fact that you sometimes wonder whether the screenwriter and director have even noticed what kind of nonsense they are shooting here. In addition, there are the usual gay references in a buddy movie, which I find embarrassing, inaccuracies in everything that is not set in the USA, such as tango music at a party of a rich snob in Valencia. The main thing is that they sing in Spanish, or what? And finally - even though I find Dwayne Johnson likeable and Ryan Reynolds sexy - the former is not an actor and the latter should stop adopting bad scripts with lousy dialogue. Oh yes, then there's Gal Gadot, who is actually just sexy and sneaky, so the usual female cliché in a film that was enough for a single tired grin on my part, but otherwise rather tempted me to check my mobile phone more and more frequently to see if someone hadn't sent me a message. That's how \"gripping\" this action comedy was.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "14 / 20"}
{"url": "https://www.imdb.com/review/rw7608912/", "title": "Red Notice", "review_header": "Beige Notice", "review_content": "This fits right in with the likes of Extraction and The Old Guard and other in a seemingly growing list of Netflix original action flicks that are full of flash but devoid of lasting substance. Red Notice is a fun movie, that's about it. There are moments of straight up laughs and then others of groanworthyness. The acting isn't exactly a spectacle, the effects are REALLY bad at times and the movie suffers from being a little too meta for its own good without properly committing to it, which really undercuts a lot of the plot movements. If this would've gone into full on meta, parodying the ridiculous action movies of the time and being self aware and referential it could've been a really fun romp. Instead it goes into half measures that feel more distracting than anything.Again, it's a fun watch and I don't regret the time spent but it's all fluff from start to ridiculous finish. It does kinda veer into Crystal Skull territory near the end (not aliens so much as just the overall vibe and stylings) which was a problem. Still fun though!", "language": "English", "rating": "5", "max_rating": "10", "helpful_review": "5 / 6"}
{"url": "https://www.imdb.com/review/rw7540234/", "title": "Red Notice", "review_header": "A Dead & Wonderless Turtle Headed Fraud...", "review_content": "Pool big red crosses through this poorly forged fakery of counterfeit chaos, contradiction & contrivance that will leave you holding your nose at the eggtraordinarily niffy necrosis emanating from plot, production and especially performances.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "239 / 497"}
{"url": "https://www.imdb.com/review/rw7598175/", "title": "Red Notice", "review_header": "Stop making junk expensive movies", "review_content": "Trying to fool its audience with turn twist instead of focusing on good script this is like an wasted opportunity with 200 million budget.just another way for rock to fool its audiences and make money of them by saying I did very hard work but audience know y u doing this junk roles.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "11 / 15"}
{"url": "https://www.imdb.com/review/rw7542742/", "title": "Red Notice", "review_header": "Name suggests u stay far away from this movie", "review_content": "One of the boring movies I have seen in recent time. One would say that the star power would be enough to drive this movie forward, but they would be wrong. Even the short interaction between RR and the Rock in Hobbs and Shaw was better than this entire movie. Gal Gadot is all charm and no substance at all. Other two are her two sidekicks as they have nothing else to do. Don't waste ur time on this.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "24 / 35"}
{"url": "https://www.imdb.com/review/rw7516289/", "title": "Red Notice", "review_header": "Boring. Generic.", "review_content": "Poorest acting for these actors.Boring action.Generic direction.Lackluster writing. Waste of time, money, and effort.Please put Gal Gadot in a good script. I dare you. Please.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "151 / 285"}
{"url": "https://www.imdb.com/review/rw7539925/", "title": "Red Notice", "review_header": "NOOOOOOO", "review_content": "Please, someone, stop hiring the Rock to \"act\". He should always appear in films grunting and nodding his head. To ask him to emote or actually deliver a line is utterly pointless.We have a hundred years of cinema behind us and an awful lot of gimmicky heist films to choose from.Don't choose this one.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "41 / 65"}
{"url": "https://www.imdb.com/review/rw7548505/", "title": "Red Notice", "review_header": "Silly and boring", "review_content": "The movie is full of plot holes and logical problems. People just show up without any knowledge of how to get there. Green screens galore, and jokes that falls flat to the ground.A movie for 10 years olds, that tries to be a movie for grown ups.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "21 / 31"}
{"url": "https://www.imdb.com/review/rw7541884/", "title": "Red Notice", "review_header": "What do you say when three A-list friends want to hang out and have fun on Netflix's dime? Thank you Netflix!", "review_content": "Was this story anything we haven't seen before? Absolutely not. Was it mindless entertainment watching three of Hollywood's top actors having fun? Absolutely yes..This was Netflix's most expensive investment to date (200M, 60M being just the 3 leads salary), and I'm sure they will still make a profit, regardless of the negativity from the critics. I mean who the heck won't pay to see any of these three actors individually, let alone all three together..The writing could've been slicker, instead of pretty much boilerplate cliched for this overused genre, but it was still a fun ride. There were some surprising twists and turns, and Ed Sheeran's cameo appearance was priceless. All three A-listers had excellent chemistry, but Reynolds tipped the scales, as usual, in the laughter department. Reynolds is Hollywood's \"Golden Boy of Humorous Entertainment\", and a gift to the rest of the world. On his own, or paired up with any actor, any film he is in, is fun as hell..The film was incredibly shot with amazing sets and landscapes, excellent cinematography and score, well directed and entertainingly written. The two-hour runtime flew by, I actually wanted more. I'm glad they closed out the film ready for a sequel, because I'd give anything to see these three together again. Ignore the picky critics; grab your favorite snacks and beverages, sit back and enjoy the fun ride. It's a well deserved 8/10 from me.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "97 / 190"}
{"url": "https://www.imdb.com/review/rw7546300/", "title": "Red Notice", "review_header": "Plain dumb", "review_content": "This has to be one of the dumbest movies that I've ever seen. What's the targeted audience? 10 year olds? Is this a comedy? No, because it will not bring even a smirk on your face. Is it a thriller? No, not a minute of suspense. Action? Plenty of it but no purpose as nobody ever gets killed. I will never understand the purpose of these goofy idiotic movies. Waste of talent.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "40 / 54"}
{"url": "https://www.imdb.com/review/rw7542326/", "title": "Red Notice", "review_header": "Gave Me A Headache", "review_content": "Just pure crap. Right from the start a million generic looking law enforcement and some annoying ugly woman who is yelling and acting in charge, of what I don't know, an egg I think.The Rocks head is very weird looking and deformed, melted almost, to the point that it's uncomfortable to look at, like nails on a chalkboard uncomfortable.Ryan Reynolds's is playing the same exact character for the millionth time and I'm sick of it, and this from someone who really enjoyed The Hitman's Wife's Bodyguard.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "47 / 72"}
{"url": "https://www.imdb.com/review/rw7540291/", "title": "Red Notice", "review_header": "Dreadful", "review_content": "Pathetic, totally uninteresting...the only minuscule good is Ryan Reynolds...everything's disappointing. Plot not engaging, didn't fancy the so called twists.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "59 / 97"}
{"url": "https://www.imdb.com/review/rw7673165/", "title": "Red Notice", "review_header": "Keep watching....all the seemingly dumb mistakes with the plot turn out to actually end up making sense.", "review_content": "While I did not love \"Red Notice\", I must admit that it's a decent time-passer. It also is a film that demands you keep watching and NOT turn it off when the writing seems bad...as, if you keep watching, you'll see that what seems bad isn't...it WILL make sense by the end of the film..The film is odd. It's like combining a heist film with \"Deadpool\"...and a bit of \"Wonder Woman\"! The film is about a couple thieves (Ryan Reynolds and Gal Gadot) who are trying to steal all three treasured eggs belonging to Cleopatra....and the film also involves folks trying to stop them. So why do I say it reminds me of \"Deadpool\"? Well, Ryan Reynolds acts just like his Deadpool character...minus all the murder. He's definitely a smart-alecky guy...perhaps too much for many viewrs. And, Gadot seems much like Wonder Woman...with fighting skills that seem almost super-human. In addition, Dwayne 'the Rock' Johnson is there to look cool and entertain.... I did like him in the film....the other two, well, the writing for their characters (particularly Reynolds) wasn't always great..Overall, not a bad movie and CLEARLY a film designed as the first of several more films...which I am sure we'll be seeing soon. But it also is a bit hard to watch at times, as it also tries too hard to be cute and clever.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "45 / 81"}
{"url": "https://www.imdb.com/review/rw7539760/", "title": "Red Notice", "review_header": "Snappy-Paced Cheeky-Banter Escapism Theme Park Ride", "review_content": "Like a movie studio theme park ride, the sets and props are exactly as one would have imagined, as is the non-stop witty repertoire one would expect from the three stars [Reynolds, Johnson and Gadot].Borrowing heavily from Indiana Jones, National Treasure, and Jackie Chan films, this heist action film injects each star's individual movie trademark style throughout.Set design and photography quality are very good, however the story itself barely gets a passing D grade, and therefore the suspense element that one expects from an interesting heist/action film is completely missing.There is nothing new here, so Red Notice leans completely on the magnetic personalties of the three leads to keep your interest, and they indeed deliver the fun banter for which each star is known.Red Notice receives a \"instant_palmer\" overall barely passing C- grade and I can only recommend to view if you are ok with a film that rates well BELOW 'National Treasure', leaning on a marginal-at-best screenplay.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "48 / 77"}
{"url": "https://www.imdb.com/review/rw7550858/", "title": "Red Notice", "review_header": "Funny but illogical", "review_content": "This movie manages to be fun at first, but then it gets tedious.In the first half of the movie there are jokes that work and there are times when you don't take the movie seriously, which makes it funnier, but there is a point where there are a lot of implausible things that just don't work and spoil how funny it can be. The script is full of conveniences and things that do not have much logic, such as the plot twist that I did not find convincing. The special effects are sometimes good but sometimes they are very false, the editing in the action scenes can seem very bad, the performances are decent as well as the production design.Full of cliches and predictable things, this movie manages to be fun, but in the long run it is tedious to watch, you do not see the large investment that was made to make this movie.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "9 / 12"}
{"url": "https://www.imdb.com/review/rw7549103/", "title": "Red Notice", "review_header": "For Devout Johnson & Reynolds Fans Only", "review_content": "This film is a payday for Johnson & Reynolds. An absurd script with mediocre direction. It is dominated by stunts and exotic locations. Johnson & Reynolds phoned it in and collected huge paychecks. We, however, were not amused.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "19 / 28"}
{"url": "https://www.imdb.com/review/rw7623144/", "title": "Red Notice", "review_header": "Like Alexa, but with guns.", "review_content": "John Hartley (Dwayne Johnson) is an FBI agent working with INTERPOL attempting to locate Nolan Booth (Ryan Reynolds) a thief who is after Cleopatra's eggs. The Bishop (Gal Gadot) enters later as someone also after the eggs..The film is an action-comedy. It is twisty. Very twisty. There is an element of Indian Jones in the feature. Hard not to enjoy..Guide: F-word. No sex or nudity.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "33 / 56"}
{"url": "https://www.imdb.com/review/rw7541900/", "title": "Red Notice", "review_header": "We got bored", "review_content": "Three good actors with some comedy but zzzz. We checked email and surfed FB. Impossible twist after silly coincidence. Bored and uninspired. Just never came together.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "51 / 85"}
{"url": "https://www.imdb.com/review/rw7570900/", "title": "Red Notice", "review_header": "Average Globetrotting Caper", "review_content": "Three of today's mega stars come together to deliver a fairly ordinary action comedy. It looks nice for the most part (except for the CGI bull), and it generates some laughs from Reynolds and Johnson's banter, though mostly just Reynolds, but it's nothing new from any of the parties. The action is over the top, along with any believability.Just know that it leaves no lasting impression, and merely entertains for the moment.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "19 / 28"}
{"url": "https://www.imdb.com/review/rw7541723/", "title": "Red Notice", "review_header": "are they men or are they muppets?", "review_content": "Apparently this film had the biggest-ever Netflix budget. I'm guessing most of it went on the stars' pay, because in other respects this feels like what it is - essentially a TV movie. It had already put us in mind of Muppets Most Wanted even before it reached the Gulag (a comparison entirely to this film's disadvantage) and, unless I'm very much mistaken the bullfighting scene was modelled on an old Bugs Bunny cartoon. Gal Gadot demonstrates that she doesn't really have leading lady charisma; the lads do their best, working their personas hard, and the script isn't awful; but what's missing is any sense that any of it matters in the slightest to anyone.The action-comedy genre is hard to pull off. Comparing this with a successful example, Hobson & Shaw, yes, you need good stars, good banter, and fancy locations don't hurt. To that point, Red Notice does okay. But you also need plenty of convincing action, and a reason for the action that makes sense and that the audience cares about; and you need not to rely too much on CGI rather than real stunts and location shooting. Those are the things where it falls short.(If those comments about locations sound contradictory, put it this way: in this case the cameras have been to some nice locations, but I'm not sure that the stars went with them.)", "language": "English", "rating": "5", "max_rating": "10", "helpful_review": "19 / 28"}
{"url": "https://www.imdb.com/review/rw7543648/", "title": "Red Notice", "review_header": "cemturc already said it all", "review_content": "\"Awful cemturc13 November 2021 Terrible acting. Terrible writing... Terrible story... Terrible dialogues... Terrible scenes.\"I couldn't stand more than 15 minutes to watch myself turning into a moron, so I just quit in time. This is one of the most ridiculous, shallow, absurd and totally unnecessary productions. Don't even understand how these two leading male actors could still be seriously taken as \"Actors\", and got fans.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "34 / 50"}
{"url": "https://www.imdb.com/review/rw7573682/", "title": "Red Notice", "review_header": "not fun", "review_content": "Clearly the makers of this movie were aiming for the sort of parodic, tongue-in-cheek, playful humor of the James Bond and Indiana Jones flicks.They missed.Whereas those movies were frothy and light-hearted, this effort comes across as mean-spirited and vicious. What little humor there is seems very forced. Unlike the Bond & Jones flicks, which were obviously put-ons from start to finish, one feels that a viewer could almost take this one at face value.Characters are always cardboard cutouts in this type of movie, but they have to be likable, including the villains, in a perverse sort of way. No one in this movie is likable. The worst is Ryan Reynolds' character, who has got to be one of the most annoying jerks ever portrayed on celluloid. Gal Gadot's Bishop is too nasty to be funny, and. Dwayne Johnson's. John Hartley seems to be phoning it in, delivering his forced-humor quips woodenly.I suppose I really shouldn't be reviewing this at all, because about halfway through I realized I didn't care what happened to anyone on screen, nor how it ended, so I stopped watching.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "17 / 25"}
{"url": "https://www.imdb.com/review/rw7552865/", "title": "Red Notice", "review_header": "No notice of its own predictable and messy sides.", "review_content": "Red Notice is a new crime comedy written, written and partly produced by Rawson Marshall Thurber, the director of Central Intelligence and Skyscraper.In the film, FBI agent John Hartley (Dwayne Johnson) is put on a case by Interpol to track down and arrest art thief Nolan Booth (Ryan Reynolds). When Hartley nearly gets hold of Booth, he has a conspiracy theory known as The Bishop (Gal Gadot). For example, he can team up with Booth in trouble and seems to get out of it on his own with Booth's help, but the question is they can work together.This movie will first hit theaters, but thanks to the Corona, several movie studios have let go of buying the movie rights, eventually starting at Netflix. Thus, this has become the most expensive Netflix original film for now.Rawson Marshall Thurber has designed this film somewhat like a crime comedy, which you often saw in the 90s. The film comes across as a mix between Indiana Jones and the Ocean's Eleven movies, but with some more comedy elements. Because the movie comes across as a 90's movie, not all elements in the movie work, want to make something look outdated or unbelievable. Furthermore, the director has written the story a bit too simple and too directed. So on the one hand it comes to look at what it can be on the far-fetched side. So can come down to it, they aren't so funny anymore. The many plot twists make the story difficult to follow, or unbelievable.They have the film in several places, which can be mentioned in the film, but unfortunately the corona pandemic were unable to portray every place. That's why they brought out these scenes in the movie studio and with a green screen the backgrounds of these places. That these moments are not really local on screen, unfortunately they are on when you can see them again. Some random shots are via FPV drone. This is the first film in which this way of filming is used.The acting is well done by the film cast. The three major stars portray their roles well, but do this a lot in their familiar way. They seem a bit standard in this film compared to their roles in other films. Dwayne Johnson and Ryan Reynolds play nice together. Yet they come across more as people who are obliged to work together. The film tries to portray them as people who start to care more and more about each other during their collaboration, but they do not really achieve this status in the film and continue to come across as a duo that is forced to work together. Gal Gadot also does well in the film, but comes out more in the middle of the film, to do something with her role.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "6 / 7"}
{"url": "https://www.imdb.com/review/rw7555334/", "title": "Red Notice", "review_header": "Like the Police don't checkout FBI BAU agents before helping them .... Total Bollocks", "review_content": "This movie sucked. It's so cliché, so predictable and so brain dead that they might as well replace dialogue with 'bla bla bla'. All those plot twists were barely twists but rather screwing with the viewer as if it had no creativity, just a simple and easy way out of a scene to go further with the story. Ryan should go back to being the guy in Amityville horror and less 6 Underground. The rock ever since he started playing Hobbs he never stopped being Hobbs. I miss the rock from Faster and Walking Tall. It's as if these actors don't watch their movies as movies but rather home videos. Just enjoying themselves and record it and get paid for being beefy and beautiful. I did like Finch though. It got to me. But this? I'm sorry you wasted your time on it. Don't waste your time.. watched it last night and it was actually one of the worst movies I've ever seen.. The rock character had no identity. Ryan Reynolds seems to play the same character over and over again. I skipped thru most of the movie.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "22 / 34"}
{"url": "https://www.imdb.com/review/rw7641965/", "title": "Red Notice", "review_header": "My Stalkers are trigged", "review_content": "A horrible movie. Very boring. Not worth watching. It's about 3 men searching for an egg. It concludes with a horrible ending..I always ask myself what is the point of making these films. They look like filth. They seem pointless. Who comes up with these filthy movies?.Don't watch this movie.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "53 / 92"}
{"url": "https://www.imdb.com/review/rw7544423/", "title": "Red Notice", "review_header": "digestable", "review_content": "Its certainly not a difficult movie. This is the type of movie you would watch when you have absolutely no energy to do anything after a long day. Making a easy movie is an art on its own. So all in all, no this is not a 'good' movie, doesn't mean you can't enjoy it.5/10: not good, but has its purpose.", "language": "English", "rating": "5", "max_rating": "10", "helpful_review": "31 / 48"}
{"url": "https://www.imdb.com/review/rw7547009/", "title": "Red Notice", "review_header": "Just shoot him, already.", "review_content": "I am not a Ryan Reynolds fan, and all I heard was his \"Deadpool\" schtick coming through. When The Rock says, \"Perhaps I should just shoot you in the face?\", I began to cheer, \"Yes! Please!\"..I had to turn it off after 15 minutes, could not STAND the dialog.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "20 / 28"}
{"url": "https://www.imdb.com/review/rw7552383/", "title": "Red Notice", "review_header": "So Bad and Boring it Rates a Short", "review_content": "Review. I got the distinct impression that two of the stars were mouthing their dialogue, reading it straight from the script. I have no doubt that the movie will make millions because its perfectly suitable for teenagers but that's about it No more Rock shows please.", "language": "English", "rating": "2", "max_rating": "10", "helpful_review": "33 / 52"}
{"url": "https://www.imdb.com/review/rw7549207/", "title": "Red Notice", "review_header": "GIVE IT NOTICE", "review_content": "Yet another low in the CGI Neverland, totally devoid of originality, insulting to anyone of average intelligence. Gal Gadot is the only thing with the slightest distinction.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "28 / 43"}
{"url": "https://www.imdb.com/review/rw7557212/", "title": "Red Notice", "review_header": "Hollywood crisis", "review_content": "Ever wondered what will happen if an unfinished AI make a movie? Well, watch and find out. They seem to have hired actors that came out on the first page when you googled actor. None of the performance is impressive, Ryan Reynolds is as expected playing Ryan Reynolds. The Rock being an absolute rock, he just freeze there with charisma not knowing exactly what to do. And Gal Gadot is like a gorgeous wooden door, she is beautiful but she has no personality whatsoever, actually none of the characters have personality. The whole thing is basically famous actors running around and shooting and dodging bullets. It's forgettable, boring, and predictable even with all the twist they put in. And of course the ending sets up for another movie.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "25 / 36"}
{"url": "https://www.imdb.com/review/rw7541572/", "title": "Red Notice", "review_header": "Nothing of notice here", "review_content": "Rock is simply wrong to play a con-man. Gal Gadot is way past her prime and even at her prime, she was not a good fit for a hot, seductive, master con-woman. She ain't hard on the eye, but she's not \"the hottest woman\" in any high level party. They both are barely actors and it shows, badly..Ryan Reynolds does act, but his acting has become too boring and predictable..The story is weak and silly, but there's no payoff. At one point, Ryan Reynolds even whistles The Indiana Jones theme and wears the Fedora, but, other than an obvious pop culture reference, there's nothing there..The worst part is, they try to crack jokes _all_ the time and fail _almost_ all the time. There's a nice, even if not a very good or funny joke, every half an hour. Since it lasts just under two hours, there's three of them..Sorry to say, this is worse than The Hitman Bodyguard's Wife. Selma Hayek, even at her age, is hotter and more interesting than Gal Gadot and Sam L Jackson is way more of a character than the Rock..Apart from the said three jokes, the only good thing about it is that it's not boring. It is not interesting, fun or engaging either and you don't feel a sense of wanting to see how this plays out, but, while it all goes on, you're not being bored..Bottom line, watch the Fast and Furious or Wonder Woman w/Gal Gadot, any Rock vehicle, Deadpool or earlier Ryan Reynolds comedy instead of this one.", "language": "English", "rating": "2", "max_rating": "10", "helpful_review": "83 / 135"}
{"url": "https://www.imdb.com/review/rw7541671/", "title": "Red Notice", "review_header": "It's as you'd expect...really bad", "review_content": "So this is what it's come to. Bad Netflix movies over and over again. I'm going to save you the misery of wasting any more time on this movie by cutting this review short. Don't waste your time. It's as bad as it gets. The age of great, consistent Hollywood movies are over. Netflix has done to movies what American Idol did to music for at least a couple of generations. Thank god for classics.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "48 / 74"}
{"url": "https://www.imdb.com/review/rw7548716/", "title": "Red Notice", "review_header": "Imagine", "review_content": "Imagine no possessions I wonder if you can.Unless, that is, you're an incredibly privileged individual whining about how \"hard\" things are.Hollywood doesn't even try to be original anymore. I can't believe people get paid so much to do so little.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "26 / 38"}
{"url": "https://www.imdb.com/review/rw7540923/", "title": "Red Notice", "review_header": "Very enjoyable...", "review_content": "Of course I had to sit down to watch the 2021 action crime comedy titled \"Red Notice\" given the three leading performers that starred in this movie. Had I heard about the movie prior to finding it on Netflix? Nope. But then again, I don't really bother keeping up with trailers and forthcoming releases.Writer and director Rawson Marshall Thurber definitely managed to put together a very entertaining and wholesome storyline and plot for \"Red Notice\". And it was a story that contains a good amount of action, comedy, thrills and plot twists. So yeah, I was certainly entertained from the very beginning and up to the end. And I must also admit that some of the plot twists were rather enjoyable and some that I hadn't foreseen coming.Needless to say that with a cast that includes Ryan Reynolds, Gal Gadot and Dwayne Johnson, then of course you are in for a stellar time with great performances. And the three lead performers definitely delivered. It should be noted that the performance from Chris Diamantopoulos and Daniel Bernhardt were also good, just wish that the latter had a bigger part to play in the movie.\"Red Notice\" takes you all across the world in a wonderful heist adventure with interesting characters, fast paced action, good comedy and also good dialogue. And the fact that the movie was very dynamic in its cinematography definitely helped to sell the movie.You should certainly sit down to watch \"Red Notice\" if you get the chance.My rating of \"Red Notice\" lands on a very well-deserved eight out of ten stars.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "234 / 436"}
{"url": "https://www.imdb.com/review/rw7569092/", "title": "Red Notice", "review_header": "Really wanted to like this but just not good", "review_content": "I really wanted to like this movie since I love Dwayne Johnson and Gal Gadot, but the script, dialog and acting was dumb. Also I really just don't like anything Ryan Reynolds is in. This movie dragged on all around the world with one dumb situation after another, by the end I didn't care. I hear they already want to make a second one. Maybe it will be better.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "9 / 11"}
{"url": "https://www.imdb.com/review/rw7546344/", "title": "Red Notice", "review_header": "Red Notice", "review_content": "Johnson goes after world's greatest art thief Reynolds who is looking for 3 priceless golden eggs once owned by Cleopatra. Both are conned and end up in a prison far from anywhere - to put things tight they must escape, bring down the villain and find the eggs..Very lavish, derivative comedy adventure featuring one expensive set piece after the other with Johnson and Reynolds hurling insults at each other at great speed for all their worth, like, well, Hobbs and Shaw. Reynolds is his usual jovial self, Johnson, possibly a little lost here and Gadot frankly underwhelming..It's all fun enough though for a couple of hours but offers nothing remotely new or exciting.", "language": "English", "rating": "5", "max_rating": "10", "helpful_review": "49 / 78"}
{"url": "https://www.imdb.com/review/rw7563735/", "title": "Red Notice", "review_header": "Stupid but fun", "review_content": "This isn't going to win any awards but it was enjoyable and pretty dam funny. I love the cast which helps. Would watch a sequel quite happily. 7.5/10.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "16 / 21"}
{"url": "https://www.imdb.com/review/rw7542630/", "title": "Red Notice", "review_header": "Meh.", "review_content": "Disappointing and forgettable. By the numbers, lazy cash grab for the three stars. The script is so weak it probably took just a week or two to write. I give it 3 stars for the charm of the trio and for some nice locations.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "65 / 99"}
{"url": "https://www.imdb.com/review/rw7543249/", "title": "Red Notice", "review_header": "What a crock of nonsensical product placement.", "review_content": "It's just not good.Reynolds is doing his usual schtick for the umpteenth time.Dwayne is doing his usual schtick for the umpteenth time.Gal Gadot is playing cliche 'hot chick' like has been on umpteen movies.Shove it on in the background whilst doing something else, it's not worth focusing on, if you do focus on it, you'll notice Reynolds trying to flog his gin.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "30 / 42"}
{"url": "https://www.imdb.com/review/rw7896748/", "title": "Red Notice", "review_header": "Unbelievable cost", "review_content": "Unbelievable that this cost Netflix $200 million to make because you wouldn't know it from watching. An utterly bland and generic scavenger hunt film, in which a trio travel the world, hunting for Cleopatra's faberge eggs (a made up plot point for the movie). Lots of exotic locations and money spent on the CGI dominated action typically involving fires and explosions, but made with a 12 certificate so very family orientated, lacking the crucial bite of a Bond or Bourne. The Rock is a little bland, Gal Gadot limited, and a wisecracking Ryan Reynolds the only mildly entertaining part of this. As for the cameo at the climax - no thanks!", "language": "English", "rating": "5", "max_rating": "10", "helpful_review": "19 / 27"}
{"url": "https://www.imdb.com/review/rw7544947/", "title": "Red Notice", "review_header": "Boring, written by, and for, children", "review_content": "$160 million for this? A poor hybrid of Oceans 12 and Raiders of the Lost Ark.So many plot conveniences, such a predictable plot, so many bad fight scenes, so much teleporting all over the planet to serve a terrible plot and sooooo long.This is the one movie when Ryan Reynolds started to bug me by being always 'on'. Very disappointing but children might find it fun.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "23 / 32"}
{"url": "https://www.imdb.com/review/rw7555402/", "title": "Red Notice", "review_header": "A cartoon with cheap jokes and takeoff acting.", "review_content": "Maybe if she were actually wonder woman I would believe that she could beat these two guys up. But it's so overplayed at this point. Gal Gadot weighs 125 pounds. The rock weights like 260. Not trying to be that guy, but there is no reality where she beats the both of them up at the same time. This movie has one of the worst twists ever in cinema imo,, it didn't make any sense and made the plot worse - completely disregarding the main relationship build over the entire movie, so none of it mattered. Unpredictability good twist. What a total waste of time triple egg nonsense. Instantly forgettable Red Notice is bad I mean real bad. Everything about this movie is awful. Awful Story, awful actors, awful characters with no depth, and the cgi is beyond laughable. Go watch the bull scene and tell me how this bad movie is worth a minute of anyone's time. Too many unfunny Ryan Reynold's jokes, too many rip-off Jackie Chan style stunts--and too many nonstop chases. Too much green screens and bad actions scenes. This movie cost as much as No time to die yet it look way less polished.", "language": "English", "rating": "3", "max_rating": "10", "helpful_review": "28 / 41"}
{"url": "https://www.imdb.com/review/rw7546920/", "title": "Red Notice", "review_header": "I fell asleep half way through this mess.", "review_content": "Sadly, I was awakened because of my snoring, and I had to finish this predictable and boring disaster. I cared nothing about the characters. The plot was a rehashing of some many cheesy action films. Nothing new here. Nothing interesting.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "27 / 36"}
{"url": "https://www.imdb.com/review/rw7549795/", "title": "Red Notice", "review_header": "Netflix thrash", "review_content": "Overall the film goes nowhere.An Interpol-issued red notice is a global alert to hunt and capture the world's most wanted. But when a daring heist brings together the FBI's top profiler John Hartley (Dwayne Johnson) and two rival criminals Nolan and Sarah (Ryan Reynolds and Gal Gadot), there's no telling what will happen. There are plenty of twists coming one after another, there's breathtaking action and then there is gripping screenplay. The 90 minutes never look boring and that's the biggest triumph for Red Notice.Netflix will make you watch it , so no way I can stop you.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "30 / 42"}
{"url": "https://www.imdb.com/review/rw8027855/", "title": "Death on the Nile", "review_header": "An empty, lifless world", "review_content": "From the opening shot of a CGI crow swooping through a World War One trench it is obvious this film detaches from reality and plays out like a comic book.The Egypt depicted in this film is a deserted sterile place: everything is CGI and there are hardly any extras.This is shot in a distractingly arty fashion with characters viewed from behind windows, railing or ceiling fans.There are some really gaudy, atmosphere-breaking scenes: like when a body is carried out on the shoulders of identically and immaculately dressed female crew members with the gravitas of a state funeral - but with an audience of ten.Characters are shot at extreme close up or from miles away - rarely anything in between.The script is slow and stogie, most characters just roll out monologues, sometimes whilst looking at another cast member, but rarely interacting.I am a big Christie fan and I like many of the adaptations (including the last Orient Express) but this was really dull and boring.The characters felt very flat, only existing to relay their one defining characteristic before fading into the background.This feels very much like watching someone playing a computer game, the player going from one task to the next, each character encountered programmed with the bare minimal of personality to progress the level.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "87 / 123"}
{"url": "https://www.imdb.com/review/rw7896056/", "title": "Death on the Nile", "review_header": "Nice twist of the ending", "review_content": "Enjoyed this movie because I was guessing who the murderer was the whole time. How the detective figured out the murder mystery was a bit surprise.BTW, love all the dancing scenes, beautifully done!", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "6 / 13"}
{"url": "https://www.imdb.com/review/rw8026747/", "title": "Death on the Nile", "review_header": "Great moustache average movie once again", "review_content": "Beautiful sets and all star cast , add the world greatest detective and once again you have trailer making this essential viewing. Then again you have a movie that gets slower losing pace with every scene Lacking intensity watchable yes great it is not.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "3 / 5"}
{"url": "https://www.imdb.com/review/rw8686875/", "title": "Death on the Nile", "review_header": "Special appearance by Cleopatra.", "review_content": "Sarah Phelps,in her TV adaptation of \"the ABC murders\" had already revealed some obscure facts of Poirot's life in the war; here ,in the prologue which has nothing to do with the novel,the screen writers registered the same desire: one sees private Poirot in the trenches where his grey cells are always at work in war strategy;furthermore, one learns why Poirot never got married (Billy Wilder did the same with Holmes in \"the private life of Sherlock Holmes\" ). Actually ,in Christie's books, Poirot was a Belgian refugee in WWI when he appears in \"the mysterious affair at Styles\",and that's it.A lot of people read the book and more saw the John Guillermin 1978 version which was successful ,so they know the whodunit and the murderer 's savoir faire. Christie's trick is as usual,brilliant. However , like he did in his remake of \"murder on the orient express\" , Brannagh ,against all odds ,almost makes new things out of old. His make up is horrible ,but his grey cells are as effective as ever ;even though you know the end ,you can enjoy it because it's shorter than the Ustinov version ,which remains unsurpassed though.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "1 / 1"}
{"url": "https://www.imdb.com/review/rw7877561/", "title": "Death on the Nile", "review_header": "Excellent if unnecessary remake", "review_content": "I thoroughly enjoyed this version of a great story. Whether it adds anything to the previous versions is debatable. In my opinion one addition that was worthwhile was the music; I notice many other reviewers don't feel the same but I thought it was joyous. I will never understand why film makers need to move away from the characterisations so beautifully painted in the original book though, really no one is going to outraged if a film has no gay characters you don't have to manufacture them. This woke box ticking is getting ridiculous.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "6 / 9"}
{"url": "https://www.imdb.com/review/rw7880102/", "title": "Death on the Nile", "review_header": "Beautiful movie, Great Acting, Overall fun", "review_content": "Overall, I really liked the movie. The film is beautiful, with lots of color and history. Costumes are amazing.The acting is mostly really good, especially the main characters. Branagh and Gadot in particular are outstanding.They changed the plot from the book in a few places (actually probably a GOOD think in a mystery, so surprise the audience), but kept the main plot line from the book. Overall, that worked for me.My complaint is that they had to through in modern culture war elements that just don't fit at all with the period piece they try so hard to portray. Imagine if Poirot pulled out a iPhone in one scene and said \"Siri, how old are the Pyramids?\" Some elements of modern culture wars are just that anachronistic when forced into a 1937 period piece just to appease 2022 culture warriors.Ignoring the out of place forced anachronisms, the rest of the movie is lots of fun.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "7 / 9"}
{"url": "https://www.imdb.com/review/rw8060458/", "title": "Death on the Nile", "review_header": "Disappointing", "review_content": "This version was disappointing all around, the acting, directing and the script. The Suchet and Ustinov version were much better. Both of those were much easier to follow and developed the characters well. Watch one of them instead.", "language": "English", "rating": null, "max_rating": "", "helpful_review": "5 / 6"}
{"url": "https://www.imdb.com/review/rw7869131/", "title": "Death on the Nile", "review_header": "Life on the Nile.", "review_content": "Finding out a few days ago that my phone company was offering free cinema tickets for Monday,I checked the cinema listings. Having seen a number of superb Agatha Christie stories such as Black Coffee on stage, I got set for a trip on the Nile..View on the film:.Shot on 65MM film, lead actor/ director Kenneth Branagh & his regular cinematographer Haris Zambarloukos use the format to give the immaculate costumes and Tiffany & Co designed jewelry worn by the suspects a shine, (with Poirot looking dapper for the entire voyage) and a smoky grain to the Jazz clubs where Salome sings..Made before, but coming out after Belfast (2021-also reviewed), Branagh makes a terrific experiment of black and white with colour contrast, as flashbacks have lone objects dipped in bright colours, highlighting the main clues on the ship..Taking place on a cruise ship or the vast majority of the run time, Branagh uncoils the mystery with a refine, glossy atmosphere of excellent extended tracking shots running down the corridors of the ship as the murder is in motion, landing on stylish arc shots and close-ups, as Poirot narrows his gaze on the lead suspects..Finding their time on the cruise ship to be ruined by a spot of murder, the ensemble cast bring a star-studded glamour to proceedings, with Gal Gadot & Emma Mackey hissing at each other like vipers as Linnet and Jackie, Sophie Okonedo hitting the high-notes as Salome, whose warmth from Okonedo gets Poirot to (somewhat) drop his guard, Kenneth Branagh captures Poirot's mind working like clockwork in piecing the clues together, and Armie Hammer chews, the scenery as Simon..Previously having dug into a character study of Wolverine with Logan (2017-also reviewed), the screenplay by Michael Green attempts to explore the background to Poirot's drive to solving cases with flashbacks, which whilst offering a unique origin to his mustache (!) does trim away at the tension from the mystery..Making a composite of some of the characters in order to make the cast list more small-scale, Green's adaptation highlights how Agatha Christie's twist still has a scorpion sting, as Poirot puts under his magnifying glass all of venom that the guests are entangled in,as a death occurs on the Nile.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "13 / 42"}
{"url": "https://www.imdb.com/review/rw8034277/", "title": "Death on the Nile", "review_header": "Like a school play", "review_content": "Everybody's over acting like they were amateurs in a fifth grade school play. The actors running around in fancy clothes in front of green screens and cgi. The dialogue are uninspired, not realistic and not taken from the book. The characters are woke and thin as card board. I found it all to be boring and uninteresting.", "language": "English", "rating": "1", "max_rating": "10", "helpful_review": "94 / 123"}
{"url": "https://www.imdb.com/review/rw7857141/", "title": "Death on the Nile", "review_header": "Good Murder Mystery", "review_content": "I saw Death on the Nile, starring Kenneth Branagh-Dunkirk, Jack Ryan:Shadow Recruit; Gal Gadot-the Wonder Woman movies, Knight and Day; Armie Hammer-The Man From U. N. C. L. E._2015, The Lone Ranger_2013 and Tom Bateman-Murder on the Orient Express_2017, Snatched..This is the second Hercule Poirot movie Kenneth has starred in that is about the famous Belgian detective created by Agatha Christie-the first was the 2017 Murder on the Orient Express. There have been previous movies based on the character. This one is produced and directed by Kenneth also. Tom plays an old friend of Kenneth's-he was in the Murder on the Orient Express, too-that invites Kenneth on a honeymoon cruise on a river boat down the Nile river in Egypt. Gal and Armie are the newlyweds that end up being on a boat of murder-it's lucky they have a detective on board. Everyone has motives and are a suspect as Kenneth uses his Sherlock Holmesian skills to determine who is guilty. Lots of twists and turns-there are more than one murder-and you learn the reason Kenneth wears that weird looking mustache. This movie was originally set to be released in 2019 but was bumped several times-various reasons include the pandemic and a certain stars' real life sexual allegations coming to light..It's rated PG-13 for violence, bloody images and sexual content-no nudity-and has a running time of 2 hours & 7 minutes..If you like good murder mysteries, you should enjoy this one. I did and I would buy this on DVD.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "16 / 46"}
{"url": "https://www.imdb.com/review/rw7873980/", "title": "Death on the Nile", "review_header": "A Timeless Story That Has Stood the Test of Time", "review_content": "Death on the Nile is a thriller based upon the famous novel by Agatha Christie that has already been adapted into numerous video games, television series, radio shows, movies and comic books. This film follows Murder on the Orient Express, written and directed by the same team five years ago. This movie brings the first half of the twentieth century to life in a nostalgic way and tells a fascinating story in great depth and detail.The story revolves around Belgian war veteran and detective Hercule Poirot who encounters his friend Bouc while vacationing in Egypt. Bouc introduces him to his friends Linnet and Simon who have recently gotten married and are celebrating their honeymoon. They decide to hire the famous detective to protect them from Jackie, who was once in a relationship with Simon and friends with Linnet and is consumed with jealousy. Things indeed take a sinister turn on the cruise ship and Hercule Poirot needs to put the different pieces of the puzzle together to come to a stunning conclusion.This film convinces on several levels. First of all, the settings are truly lush and should be enjoyed on the big screen. This starts with the extravagant clothing, continues with beautiful make-up and concludes with authentic objects from the thirties and stunning locations in a beautiful country.Up next, the acting performances are overall quite decent. Kenneth Branagh convinces as cunning, curious and dynamic detective with a lonesome lifestyle and saddening past. Emma Mackey shines as aggressive, sensible and sinister antagonist who haunts everybody on the cruise ship. Armie Hammer delivers the goods as good-looking but shady husband who is playing a very dangerous game.The highlight of the movie remains the fascinating story line. Once the first crime takes place, the viewers will follow a dramatic sequence of events that will keep them putting the pieces together until the very end. The story has aged rather well and is exceptionally brilliant. If you are not familiar with the novel or earlier adaptations of it, this movie will leave a lasting impression and might deserve multiple viewings to fully grasp all the details of the numerous crimes that have been going on.A special shoutout goes to the movie's imaginative opening and closing. The former shows a clever young Hercules Poirot who manages to save his fellow soldiers during the horrors of the First World War but is unable to protect his captain and himself. The latter shows how the aging detective is slowly putting a term to his lonesome lifestyle and opens up to let his heart rule his mind again.The movie obviously also has some minor flaws. The first half is unnecessarily long as it takes half of the film before any significant dramatic events occur. Up next, the acting performances aren't as universally convincing as in the famous adaptation of the seventies with acting legends such as Bette Davis, Mia Farrow, Angela Lansbury, David Niven and Peter Ustinov.However, Death on the Nile is a timeless thriller that still convinces in its most recent adaptation with outstanding settings, excellent plot, great acting performances and a few creative twists in the opening and closing sequences. Fans of the novel and its numerous adaptations should certainly appreciate this film. Anyone who likes clever whodunits should give this marvelous movie a chance.", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "14 / 39"}
{"url": "https://www.imdb.com/review/rw7871856/", "title": "Death on the Nile", "review_header": "Sloppy mess.", "review_content": "Just got back from watching \"Death on The Nile\" & I'm not even lying when I say Kenneth Branagh has chosen to shoe-horn in a WW1 related backstory to show why Hercule Poirot has a moustache... As if we needed an explanation, detailing the reason for a character's facial hair..At this rate, Hollywood will be giving us an origin story for Agatha Christie's bikini wax..Seriously though, the most suspenseful thing was the unmasked woman conspicuously coughing (continuously) throughout, further down the aisle of the cinema. It's a superficial adaptation, worsened by Kenneth Branagh's artificial direction, bad VFX, amateurish continuity errors & horrendous chewing of scenery by actors giving some of the worst performances of their careers.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "82 / 113"}
{"url": "https://www.imdb.com/review/rw7858116/", "title": "Death on the Nile", "review_header": "suggestion for next time", "review_content": "As an agatha christie fan who has read most of agatha christie books multiple times i wish kenneth branagh would adapt one of the many other wonderful poirot books: the abc murders, five little pigs, dumb witness, cat among the pigeons, etc. Instead of trying to modernize an existing (and fine) movie.No way to replicate those ensembles: sean conneey, bette davis, ingrid bergman, etc. Might as well have a fresh start to avoid comparison.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "13 / 20"}
{"url": "https://www.imdb.com/review/rw7856830/", "title": "Death on the Nile", "review_header": "A serviceable murder mystery which was never boring but never really engrossed or thrilled me either.", "review_content": "It's visually spectacular with dramatic scenery and music, but the story was somewhat lacking, even with the heartfelt 'origins of Poirot' start. The characters are all well rounded and well-acted and Poirot's performance was very entertaining, but the big reveal didn't quite match the build-up, which in turn was all over the place.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "10 / 24"}
{"url": "https://www.imdb.com/review/rw7857060/", "title": "Death on the Nile", "review_header": "Takes A While To Get Going, But...!", "review_content": "So, I somehow completely forgot about The Orient Express Film which of course is an Agatha Christie Adaption like this film is & have now just learned that this film is a sequel to the 2017 predecessor. But I also forgot about this film entirely until this year, only after seeing this advertised a couple of times after Cinemas re-opened in late 2020 after the first lockdown. As such, I finally got around to watching this sequel..The film sees Hercule Poirot solving another murder, this time in Egypt on a Paddle Boat along the Nile with a case involving the murder of a woman who is fatally shot in the head. Just like The Orient Express, there's nowhere for the killer to hide, so the whodunit is just as interesting this time around..I found the film to be pretty good. It takes a while for it to get going mind & somewhat drags quite a bit I must say until things start to get juicy, but it's great once it gets down to the nitty gritty part of the film. The pacing is a bit off at the start but the build up isn't too bad although the film is 2 hours long & could be shorter..The cast were good a couple of well knowns such as Russel Brand & Gal Gadot, the others I've seen a few times in others films but can't quite place them. The story & it's twist were good & it really leaves you guessing who the killer(s) are..Overall, it's a decent sequel (which I now know) to The Orient Express, which I can just about remember... the film itself is good with an interesting story & not a bad twist, but does drag somewhat at the first hour before things start to get good & interesting. But I'd recommend this a watch I think..7/10.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "11 / 28"}
{"url": "https://www.imdb.com/review/rw7857344/", "title": "Death on the Nile", "review_header": "Another Entry Into Agatha Christie", "review_content": "It's a shame if you don't get the opportunity to see this on the biggest screen possible. Because the production design, costumes and meticulous attention to detail deserves to be seen big.So it's no surprise that underrated director Kenneth Brannagh tackles another Agatha Christie novel.Here detective Hercule Poirot gets a backstory. The lesson of love gotten and love lost and...well, just love. Perfect for the Valentine's Day coming up no doubt. However, this love story is poisoned by murder. That of an heiress (Gal Gadot) who recently marries a handsome gadfly (Armie Hammer). When on their honeymoon, someone is murdered, Hercule goes into detective mode. BUT, he isn't there strictly for that. Secrets unveil themselves as they need be and the final solution isn't anything...mind blowing, if you watch crime stories, it is the journey to get there that is fun.Shot in eye popping 65mm film, much praise goes to cinematographer Haris Zambarloukas. Wonderful scenery that seems to stretch forever and still feel intimate. The colors are warm to fit the Egyptian locale. And the colors throughout the day offer so much romantic notions through bad behavior.The same was said about \"Murder On The Orient Express\" Another \"big picture\" mystery. Everything feels wonderfully old school Hollywood. Which will reward those who remember when making these types of film meant something.I really hope Brannagh makes another entry into Christie's work. They are a lot of fun, full of glamour and respect for quality Hollywood.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "13 / 32"}
{"url": "https://www.imdb.com/review/rw7915605/", "title": "Death on the Nile", "review_header": "Sufficiently entertaining but too many flaws to merit a higher rating", "review_content": "Positives:.Negatives:", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "7 / 9"}
{"url": "https://www.imdb.com/review/rw7899660/", "title": "Death on the Nile", "review_header": "Fine", "review_content": "Not like the book at all I loved the book so I went to see it in cinema and it had characters that weren't in the book after the murders got discovered they didn't shoot themselves in the book it was good but nothing like the book.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "4 / 5"}
{"url": "https://www.imdb.com/review/rw7877835/", "title": "Death on the Nile", "review_header": "Takes Too Long to Get to the Death", "review_content": "A solid adaptation of the classic novel, well-led by Branagh in character, but not entirely satisfying on the whole.Once the brief Poirot backstory is covered, the build-up of events leading to -the- death is unbearable. Too much of the film's runtime is spent watching rich people gallivant and enjoy their wealth, whilst repeatedly mentioning their own wealth. The characters, bar Poirot, are largely dislikable and once the death finally comes it enters the film as welcome relief from a dull and irritating foundation. Many of the characters that are later accused of murder are fairly skimmed over too, focus lying on the main trio, creating small and insignificant arcs for the rest later on.Once the murder has taken place, and Poirot finally has the opportunity to be Poirot, things get rapidly more interesting. Whilst the finale can be claimed to be the most obvious option by many, the lead up to the reveal does provide interest across the characters, and the investigation feels swift as it is enjoyable (and simple) to follow.Unfortunately, it's all too clear that many of the settings are green-screen, so something that should be visually stunning is a little dissatisfying. Acting is acceptable on the whole, in fact it is actually Gadot and Hammer - two of the highest billed - who feel a little unsatisfactory, but that could be due to the characters being insufferable. Surprisingly, the (somewhat brief) appearances made by the comedy duo French & Saunders, plus Brand are impressive and fit well into the storyline. Branagh is a great Poirot though, and easily the standout in his own film.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "5 / 9"}
{"url": "https://www.imdb.com/review/rw7884258/", "title": "Death on the Nile", "review_header": "BELOW AVERAGE", "review_content": "If one were to compare the 2022 version with the 1978 evergreen classic of the same name then this latest one is an extreme and massive disappointment with terrible acting by everyone in the film including KB.However if one were to judge on its own then at best it's a below average movie with absolutely nothing praiseworthy at all.4/10.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "140 / 194"}
{"url": "https://www.imdb.com/review/rw7864602/", "title": "Death on the Nile", "review_header": "Enjoyable Whodunit", "review_content": "I thought the movie was very enjoyable and had me guessing; and anxious to see if my pick of who did it was correct. The setting and boat scenes are beautiful. And the cast was great!", "language": "English", "rating": "8", "max_rating": "10", "helpful_review": "9 / 13"}
{"url": "https://www.imdb.com/review/rw7910578/", "title": "Death on the Nile", "review_header": "Eh it's a good thriller", "review_content": "It's not bad really. But the Orient Express was much better. They didn't tell you who the killer was upfront..This one basically tells you the killer up front although the twists to get there and some reveals are not important and a bit unbelievable and deaths yes more than 1 the sorrow is over the top for one and basically non existent for another. Then you have the Romeo and Juliet unbelievable ending.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "4 / 5"}
{"url": "https://www.imdb.com/review/rw7848695/", "title": "Death on the Nile", "review_header": "Murders Most Melodramatic", "review_content": "Jacqueline de Bellefort introduced her handsome but penniless fiance Simon Boyle to her wealthy friend Linnet Ridgeway. However, it would turn out later that Simon dumped Jackie and had married Linnet instead. So when the newly-married couple went on a grand honeymoon in Egypt, the rejected Jackie stalked them the whole way, even booking herself on a cruise of the Nile on the river boat Karnak, on which the Doyles were also booked.One night, there was a murder onboard the boat, someone had been shot at close range on the forehead. When famed Belgian detective Hercule Poirot began to investigate, every other passenger on the cruise with them seemed to have a reason to kill the victim, who it turned out was not exactly the congenial type. A couple more murders were still to be committed before Poirot was able to finally piece together the complex plot.In the original 1978 film version of \"Death on the Nile\" directed by John Guillermin, Peter Ustinov played the inimitable Belgian sleuth Hercule Poirot, taking over from Albert Finney who played Poirot in \"Murder on the Orient Express\" (1974). Just like first film, the murder had been committed in a confined location (this time a river boat). It also had an impressive array of actors playing the suspects for the murder of Linnet Ridgeway (Lois Chiles).The all-star cast included Bette Davis (as the grand dame Marie Van Schuyler), Maggie Smith (her stern nurse Ms. Bower), Angela Lansbury (flighty romance author Salome Otterbourne), Olivia Hussey (her anxious daughter Rosalie), Jack Warden (the defensive Dr. Bessler), George Kennedy (the unscrupulous Atty. Andrew Pendleton), Jane Birkin (Linnet's maid Louise), Mia Farrow (Jackie), and Simon MacCorkindale (Simon).In this new film remake, Poirot (Kenneth Branagh) was investigating the case of Linnet Ridgeway (Gal Gadot). Simon (Armie Hammer) was her husband, Jackie (Emma Mackey) her friend, and Louise (Rose Leslie) her maid. Some characters had the same names but different relationships. Marie Van Schuyler (Jennifer Saunders) was now Linnet's godmother, with Ms. Bowers (Dawn French) her nurse. Salome Otterbourne (Sophie Okenedo) was now a blues singer, while her niece Rosalie (Letitia Wright) was Linnet's close friend.There were also characters whose names and relationships with Linnet were changed. The lawyer character is now Linnet's cousin Andrew Katchadourian (Ali Faizal). The doctor character is now Linnet's ex-fiance Linus Windlesham (Russell Brand). Instead of David Niven's Col. Race, the role of Poirot's friend went to Bouc (Tom Bateman), who was also in the previous case on the Orient Express. Bouc brought his artist mother Euphemia (Annette Bening) along, and was in a romantic relationship with Rosalie.Gal Gadot fit the bill of the glamourous heiress to a T. However, she did not project Linnet's haughtiness that well, unlike how Lois Chiles did it. Emma Mackey (whom I never knew before this film) had a more challenging role as Jackie. However, she looked quite strong and confident, unlike how Mia Farrow gave her Jackie a weak, clingy, needy vibe the character needed. Armie Hammer's screen presence seems diminishing with his every film, even in a big role as Simon. Tom Bateman even upstaged him in more minor role as Bouc.Aside from a prologue (why Poirot grew his fancy mustache) and an epilogue (how Poirot may be falling in love again), the basic plot of the novel remained the same with significant alterations to promote present-day concerns like multi-racial and LGBTQ representations. The production design was rich with 1930s aristocratic glamor and exotic Egyptian antiquities. With a much darker color palette and serious mood, Branagh's approach tended to be quite melodramatic, especially at the climax, without the campy humor of the original.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "20 / 54"}
{"url": "https://www.imdb.com/review/rw7877923/", "title": "Death on the Nile", "review_header": "I seen it coming, I'm a great detective.", "review_content": "I figured out fairly quickly tbh, the costumes looked great the acting was great but there's one gripe that is starting to really annoy me in film's...horrible horrible CGI, it's so lazy now you can literally see they're standing infront of a screen in some studio back lit uts rather off putting imo. I didn't think we needed a back story to the moustache if I'm being honest and there's a couple of \"woke\" bits shall we say.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "6 / 9"}
{"url": "https://www.imdb.com/review/rw8117863/", "title": "Death on the Nile", "review_header": "An anti-vaxxer, a conspiracy theorist and a cannibal walk into a cruise ship...", "review_content": "How did Poirot get his moustache? If the answer isn't that his moustache is actually an alien that crash-landed on Earth, crawled its way onto his upper lip and entered into a symbiotic relationship with him that granted him the brainpower needed to become the 'greatest detective in the world' (which, spoiler alert, it isn't), then that answer doesn't need to be seen on the big screen. Yet, 'Death On The Nile (2022)' opts to open with a black-and-white pre-title sequence (ala 'Casino Royale (2006)') that gives Poirot's lip-warmer a tragic backstory to imbue it with thematic resonance.If it weren't done so earnestly, it could easily be considered a joke, or a slice of scathing satire aimed at studios who opt to adorn their flagship franchises with unnecessary prequels and spin-offs based wholly on superficial elements of the mainline entries. There isn't a shred of irony to be found here, though. Instead, we get a serious (yet seriously unsuccessful) attempt at getting the audience to cry in the opening moments and a sequence which does nothing other than confuse those expecting to see an adaptation of Agatha Christie's source novel (some members of my family genuinely thought I had put the wrong film on).When things shift into colour, you may expect the picture to get significantly better. However, the flick once again subverts your expectation in the worst way possible. I don't think it's a spoiler to say that, eventually, there is a death on the Nile, but it takes absolutely ages before that actually happens (literally over an hour). That isn't an inherently bad thing; a murder-mystery could use a long set-up to carefully put its dominoes into place while getting us to care about its characters, something which would make the inevitable killing all the more impactful. This doesn't do that, though. For a very long time, the picture isn't so much a whodunit as a whocares.The flick banally introduces its characters one at a time without building a shred of suspense, all while it treats us to some seriously wonky CGI vistas (a couple of shots brought 'Star Wars: Episode I - The Phantom Menace (1999)' to mind) and occasionally gives us a glimpse of the OCD Poirot is apparently famous for. Though the affair admirably attempts to make his involvement in the case more personal, the heroic detective just isn't a compelling protagonist. He's undercooked, present only to ponder false leads and eventually deliver the mystery's ultimate solution. The surrounding story just isn't strong enough to justify a placeholder protagonist (unlike in, say, a 'James Bond' or 'Mission: Impossible' movie). This is likely a failing of the source novel (or, rather, something that prevents it from translating well to film), as is the fact that the climax amounts to little more than someone telling everyone else (and us) the plot. Still, an adaptation isn't bound by the shortcomings of its inspiration, even though faithfulness is something most fans seem to covet. Therefore, I think it's fair to criticise the picture for its translation issues.In terms of narrative, the picture is a mixed bag. Its central conundrum just isn't wrinkled enough, despite the movie's efforts to switch things up as it approaches its finale. There is the occasionally unexpected moment, but mostly it plays out kind of how you'd expect it to. Perhaps a bigger issue is the fact that the film doesn't actively inspire you to engage with its enigma. There came a point where I remember thinking \"I'll take a guess and say that this person is the killer, but I won't get any sort of satisfaction if I'm right and I genuinely don't care if I'm wrong.\" The flick is the sort of thing that just washes over you, never truly engaging even when it's at its most entertaining. Plus, its eventual reveal is handled so matter-of-factly that it doesn't even register as shocking (though that's perhaps because it isn't actually shocking at all) and it inspires nothing more than a meek \"oh... okay.\"I know it sounds like I hate the picture, but I don't. Once the eponymous death on the Nile finally occurs, it kicks into gear and gets a lot more enjoyable. Though it isn't intellectually or emotionally stimulating, it's fun enough for what it is. The movie elects to reduce its cast and connect all of its characters to the victim, crafting a web of interpersonal relationships that simply isn't present in the book (which I haven't read, by the way). This is a good choice that makes the story feel more purposeful and personal than it otherwise would have. The piece also decides to bring back a character from 'Murder On The Orient Express (2017)', which gives Poirot a likeable on-screen friendship and a more compelling reason to be on board.The cast is relatively strong, although some members certainly do better than others. They all turn in admirable performances and do the best with what they're given, but most of them just aren't given enough. The elephant on the boat is, of course, Armie Hammer, whose involvement in the affair is responsible for its most recent delay. One of the biggest sins the film commits is making us watch the guy dry hump someone for what seems like five minutes, and this happens more than once. I mean, come on, Ken, really? Other iffy performers include anti-vaxxer Letitia Wright and conspiracy theorist Russell Brand, but neither of them make you feel anywhere near as gross as Armie 'humping' Hammer. Plus, they perform just as well as most of their counterparts.In front of the camera, Kenneth Branagh chews on his accent amicably enough, doing what he needs to with a fair bit of gravitas. Behind it, however, his direction just feels a bit flat. He just never does anything unexpected. It's incredibly obvious that the flick was shot on sets surrounded by nothing other than green or blue, and there isn't much atmosphere to be found. The cinematography doesn't help, either. Everything is just a bit too clean, resulting in a glossy adventure that doesn't even manage to make its deaths seem upsetting (the actors still look glamourous even when they're supposed to be corpses, adorned with neat little bullet wounds or daintily slashed throats).Again, I don't want to rag on the thing too much. It's decently enjoyable once it gets going, the kind of funhouse fluff that would be right at home on ITV. It's a forgettable yet sort of affable affair, one that doesn't really require your full attention. If you can get past its first hour, there are more than a couple of things to like about it. It's fine.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "4 / 7"}
{"url": "https://www.imdb.com/review/rw7952482/", "title": "Death on the Nile", "review_header": "Mystery that leaves you more bored than surprised.", "review_content": "2 out of 5 stars.Death on the Nile is a boring mystery film that does not improve from its previous film. And the sequel is no better. Besides putting the film in a beautiful set piece on a boat and beautiful visual effects of the Nile river and Egypt setting.The film does have a promising cast ensemble. Kenneth Branagh does great with the role. The newcomers like Annette Being, Russell Brand, Gal Gadot, Armie Hammer, Letitia Wright and many others are all talented.The script drags the story. The direction is slow and boring. Every clue is revealed slowly, and when the twist is revealed. It is no surprise or giving you that thrill. I found the film to be boring and slow. The story is decent. The direction and script could have been so much better for a whodunit kind of film.", "language": "English", "rating": "4", "max_rating": "10", "helpful_review": "146 / 206"}
{"url": "https://www.imdb.com/review/rw7885956/", "title": "Death on the Nile", "review_header": "I Found It OK", "review_content": "I just got out of Death on The NileI don't know if was my screening but the audio was awful, with an echo effect.I thought It was ok, It doesn't have the star power of the first movie, Dawn French and Jennifer Saunders are no Michelle Pfeiffer and Dame Judy Dench!! Armie Hammer has a big role so the ick factor is unfortunately there a lot. All the performances are fine, but sadly I figured it out pretty early on.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "15 / 37"}
{"url": "https://www.imdb.com/review/rw7849903/", "title": "Death on the Nile", "review_header": "You will be in de-nile about how slow this film is", "review_content": "There's a solid story in here, but the film really needed to cut 20 minutes off its runtime. The middle act of this film draaaags on, when it is supposed to be the most interesting part as we try to solve the mystery.The acting was a mixed bag. Some people were great in their roles, others felt like emotionless voids spewing out dialogue to get a quick paycheck.The locations the crew visit are fun and more varied than the previous film's static locale.The ending was solid and justified the experience, but I wish it didn't take so long to get there.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "16 / 28"}
{"url": "https://www.imdb.com/review/rw7913219/", "title": "Death on the Nile", "review_header": "Entertaining but not as good as it could be", "review_content": "I'm a big fan of Agatha Christie, but I maybe had high hopes for the movie. The movie was not bad and I liked to see in moving pictures what I imaged from the book, but I thought the investigation could be instigating as it was in the book. It is part of problem of converting books into the movie, sometimes it is difficult to take everything. If you do go to the movies, go expecting an entertainment time, don't have high hopes.", "language": "English", "rating": "7", "max_rating": "10", "helpful_review": "6 / 8"}
{"url": "https://www.imdb.com/review/rw7879110/", "title": "Death on the Nile", "review_header": "A good movie but a weird poirot movie", "review_content": "Movie done well but which also has several flaws. There is an excessive use of CGI, there are exaggeratedly sensual scenes for a Poirot movie, the characters are so exaggerated as to flatten the grotesque and are violently tucked into the plot of modern themes that had no bearing on the story.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "9 / 15"}
{"url": "https://www.imdb.com/review/rw8019363/", "title": "Death on the Nile", "review_header": "A decent yet forgettable bland movie", "review_content": "Death On The Nile is the sequel to the 2017 film Murder On The Orient Express and features an all star cast from Kenneth Branagh(who produced and directed this film),Armie Hammer(Mirror Mirror),Gal Gadot(Wonder Woman),Dawn French(The Vicar Of Darby),Jennifer Saunders(Absolutely Fabulous),Letitia Wright(Black Panther),Russell Brand(Get Him To The Greek)..Herculean Poriot(Branagh)boards a cruise where a rich couple named Linnet Ridgeway(Gadot) and Simon Boyle(Hammer) are celebrating their marriage by throwing a lavish party on a ship. However tragedy strikez when Linnet is found murdered in her bed and its up to Hercule to find the killer, before they strike again. Could it be Linnet's husband's former fiance Jacqueline (Emma Mackey) or was it Simon himself that killed her so that he could reunite with his former mistress?.Overall it was a decent film yet I enjoyed the first one better as it left me guessing who killed Johnny Depp's charcther,whereas this one I knew from the get go who the killer was as I said it to myself all along and it turned out I was right ..6/10.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "6 / 10"}
{"url": "https://www.imdb.com/review/rw8342007/", "title": "Death on the Nile", "review_header": "Slow and Dreary", "review_content": "I hope a genius like Kenneth Branagh can find another outlet for his directorial style and leave Dame Christie alone. I guess he fancies himself Poirot and wants that role. Like with Orient Express, he is not all that interesting. If anything, he gets a little too flamboyant at times. The story is great in the book. Here it plods along, taking nearly the first half for anything to happen. It's more than exposition. In one scene there is a menu of characters presented to the viewer. Show them. Don't tell them. I have to say I was disappointed because I was told by a friend that this was really an excellent movie. Live and learn.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "3 / 4"}
{"url": "https://www.imdb.com/review/rw7852756/", "title": "Death on the Nile", "review_header": "A relaxing ride with murder.", "review_content": "\"The crime is murder. The murderer is one of you. I have investigated many crimes, but this has altered the shape of my soul. I am detective Hercule Poirot, and I will deliver your killer.\" Hercule Poirot (Kenneth Branagh)In the newest Agatha Christie/Hercule Poirot mystery, Death on the Nile, Poirot is about as serious as mystery fiction would allow, and certainly the obsessive Poirot would allow. Because one of the murder victims means much to him, and because he is smitten by jazz singer Salome (Sophie Okonedo), Poirot is a full-bodied detective sharing some of our humanity and bringing a sympathy without witty accusations.The location in an elegant paddle boat on the Nile and remarkable gigantic effigies of Ramses and the Sphinx lends a historicity to the proceedings while the icons tie vacationers to our sometimes-wicked natures. The new Queen of the Nile, Linette (Gal Godot), is grandly wealthy, gorgeous, and like the rest of us, vulnerable. Her new husband, Simon (Armie Hammer), is attentive but does not match her wealth, yet matches her gorgeous looks.The rest of the cast is appropriately good looking and fit for suspicion, each with his/her reason to off the new bride. They may be the least intricate and magical of the suspects in this sub-genre, if only because Christie, director Branagh, and writer Michel Green are careful not to give much away while they develop characters real and weak, rightfully suspect as we all might be in similar circumstances.The operative motif is love-mainly what we do for it, sometimes murder. This notion of potential mayhem in the wake of passion is well-chosen, for without its heat the mystery is just a lazy day down the river. It's not that but rather is a treatise on the conjunction of love and sin, real or metaphorical. What we do for love, how we live without it, even Poirot, is the subject of Death on the Nile, gently woven into a seemingly light murder mystery. It is after all about \"death.\"\"The romance of the desert has the power to seduce. I ask you: have you ever loved so much, been so possessed by jealousy, that you might kill?\" Poirot.", "language": "English", "rating": null, "max_rating": "", "helpful_review": "20 / 45"}
{"url": "https://www.imdb.com/review/rw7865023/", "title": "Death on the Nile", "review_header": "This is not neither the best nor the worst, a bit average", "review_content": "Death on the Nile follows Hercule Poirot who is a detective is invited to attend a marriage celebrate of Simon Doyle and Linnet Ridegway, an heiress. While the celebrating, Linnet Ridegway is found dead on bed. Who's behind this and what was the motive?.For me, it seems really average type. I pick to watch this as I'm big fan of Agatha Christie novels and I watched almost all movies that were based on her novels. I loved the movie, specially\" The murder on the orient express,1974\"However,I didn't love this one. I feel like, there is a lack of suspense from starting till end. As she was murdered and his husband was just shot on the leg. It was easily guessable who's behind this. Most importantly, the main so called culprit becomes senseless after shooting his love and later she was under someone's observation all night, it seems, it was all planned. They were previously in loved and suddenly split up of course that for the money. If she dies, her husband will eventually inherits that. Seriously guys,anyone could have guessed.", "language": "English", "rating": "6", "max_rating": "10", "helpful_review": "13 / 24"}
